MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX230F256B.atdf
         <register caption="USB OTG Interrupt Enable Register" name="U1OTGIE" offset="0x10" rw="RW" size="4">
            <bitfield caption="A- Vbus Valid Interrupt Enable bit" mask="0x00000001" name="VBUSVDIE" values="U1OTGIE__VBUSVDIE" />
            <bitfield caption="B-Session End Interrupt Enable bit" mask="0x00000004" name="SESENDIE" values="U1OTGIE__SESENDIE" />
            <bitfield caption="Session Valid Interrupt Enable bit" mask="0x00000008" name="SESVDIE" values="U1OTGIE__SESVDIE" />
            <bitfield caption="Bus Activity Interrupt Enable bit" mask="0x00000010" name="ACTVIE" values="U1OTGIE__ACTVIE" />
            <bitfield caption="Line State Interrupt Enable bit" mask="0x00000020" name="LSTATEIE" values="U1OTGIE__LSTATEIE" />
            <bitfield caption="1 Millisecond Timer Interrupt Enable bit" mask="0x00000040" name="T1MSECIE" values="U1OTGIE__T1MSECIE" />
            <bitfield caption="ID Interrupt Enable bit" mask="0x00000080" name="IDIE" values="U1OTGIE__IDIE" />
         </register>
         <register caption="USB OTG Status Register" name="U1OTGSTAT" offset="0x20" rw="RW" size="4">
            <bitfield caption="A-Device Vbus Valid Indicator bit" mask="0x00000001" name="VBUSVD" values="U1OTGSTAT__VBUSVD" />
            <bitfield caption="B-Device Session End Indicator bit" mask="0x00000004" name="SESEND" values="U1OTGSTAT__SESEND" />
            <bitfield caption="Session Valid Indicator bit" mask="0x00000008" name="SESVD" values="U1OTGSTAT__SESVD" />
            <bitfield caption="Line State Stable Indicator bit" mask="0x00000020" name="LSTATE" values="U1OTGSTAT__LSTATE" />
            <bitfield caption="ID Pin State Indicator bit" mask="0x00000080" name="ID" values="U1OTGSTAT__ID" />
         </register>
         <register caption="USB OTG Control Register" name="U1OTGCON" offset="0x30" rw="RW" size="4">
            <bitfield caption="VBUS Discharge Enable bit" mask="0x00000001" name="VBUSDIS" values="U1OTGCON__VBUSDIS" />
            <bitfield caption="VBUS Charge Enable bit" mask="0x00000002" name="VBUSCHG" values="U1OTGCON__VBUSCHG" />
            <bitfield caption="OTG Functionality Enable bit" mask="0x00000004" name="OTGEN" values="U1OTGCON__OTGEN" />
            <bitfield caption="VBUS Power-on bit" mask="0x00000008" name="VBUSON" values="U1OTGCON__VBUSON" />
            <bitfield caption="D- Pull-Down Enable bit" mask="0x00000010" name="DMPULDWN" values="U1OTGCON__DMPULDWN" />
            <bitfield caption="D+ Pull-Down Enable bit" mask="0x00000020" name="DPPULDWN" values="U1OTGCON__DPPULDWN" />
            <bitfield caption="D- Pull-Up Enable bit" mask="0x00000040" name="DMPULUP" values="U1OTGCON__DMPULUP" />
            <bitfield caption="D+ Pull-Up Enable bit" mask="0x00000080" name="DPPULUP" values="U1OTGCON__DPPULUP" />
         </register>
         <register caption="USB Power Control Register" name="U1PWRC" offset="0x40" rw="RW" size="4">
            <bitfield caption="USB Operation Enable bit" mask="0x00000001" name="USBPWR" values="U1PWRC__USBPWR" />
            <bitfield caption="USB Suspend Mode bit" mask="0x00000002" name="USUSPEND" values="U1PWRC__USUSPEND" />
            <bitfield caption="USB Module Busy bit" mask="0x00000008" name="USBBUSY" values="U1PWRC__USBBUSY" />
            <bitfield caption="USB Sleep Entry Guard bit" mask="0x00000010" name="USLPGRD" values="U1PWRC__USLPGRD" />
            <bitfield caption="USB Activity Pending bit" mask="0x00000080" name="UACTPND" values="U1PWRC__UACTPND" />
         </register>
         <register caption="USB Interrupt Register" name="U1IR" offset="0x1c0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="URSTIF_DETACHIF" />
            <bitfield caption="USB Error Condition Interrupt bit" mask="0x00000002" name="UERRIF" values="U1IR__UERRIF" />
            <bitfield caption="SOF Token Interrupt bit" mask="0x00000004" name="SOFIF" values="U1IR__SOFIF" />
            <bitfield caption="Token Processing Complete Interrupt bit" mask="0x00000008" name="TRNIF" values="U1IR__TRNIF" />
            <bitfield caption="Idle Detect Interrupt bit" mask="0x00000010" name="IDLEIF" values="U1IR__IDLEIF" />
            <bitfield caption="Resume Interrupt bit" mask="0x00000020" name="RESUMEIF" values="U1IR__RESUMEIF" />
            <bitfield caption="Peripheral Attach Interrupt bit" mask="0x00000040" name="ATTACHIF" values="U1IR__ATTACHIF" />
            <bitfield caption="STALL Handshake Interrupt bit" mask="0x00000080" name="STALLIF" values="U1IR__STALLIF" />
         </register>
         <register caption="USB Interrupt Enable Register" name="U1IE" offset="0x1d0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="URSTIE_DETACHIE" />
            <bitfield caption="USB Error Interrupt Enable bit" mask="0x00000002" name="UERRIE" values="U1IE__UERRIE" />
            <bitfield caption="SOF Token Interrupt Enable bit" mask="0x00000004" name="SOFIE" values="U1IE__SOFIE" />
            <bitfield caption="Token Processing Complete Interrupt Enable bit" mask="0x00000008" name="TRNIE" values="U1IE__TRNIE" />
            <bitfield caption="Idle Detect Interrupt Enable bit" mask="0x00000010" name="IDLEIE" values="U1IE__IDLEIE" />
            <bitfield caption="RESUME Interrupt Enable bit" mask="0x00000020" name="RESUMEIE" values="U1IE__RESUMEIE" />
            <bitfield caption="ATTACH Interrupt Enable bit" mask="0x00000040" name="ATTACHIE" values="U1IE__ATTACHIE" />
            <bitfield caption="STALL Handshake Interrupt Enable bit" mask="0x00000080" name="STALLIE" values="U1IE__STALLIE" />
         </register>
         <register caption="USB Error Interrupt Status Register" name="U1EIR" offset="0x1e0" rw="RW" size="4">
            <bitfield caption="PID Check Failure Flag bit" mask="0x00000001" name="PIDEF" values="U1EIR__PIDEF" />
            <bitfield mask="0x00000002" name="CRC5EF" />
            <bitfield caption="CRC16 Failure Flag bit" mask="0x00000004" name="CRC16EF" values="U1EIR__CRC16EF" />
            <bitfield caption="Data Field Size Error Flag bit" mask="0x00000008" name="DFN8EF" values="U1EIR__DFN8EF" />
            <bitfield caption="Bus Turnaround Time-Out Error Flag bit" mask="0x00000010" name="BTOEF" values="U1EIR__BTOEF" />
            <bitfield caption="DMA Error Flag bit" mask="0x00000020" name="DMAEF" values="U1EIR__DMAEF" />
            <bitfield caption="Bus Matrix Error Flag bit" mask="0x00000040" name="BMXEF" values="U1EIR__BMXEF" />
            <bitfield caption="Bit Stuff Error Flag bit" mask="0x00000080" name="BTSEF" values="U1EIR__BTSEF" />
         </register>
         <register caption="USB Error Interrupt Enable Register" name="U1EIE" offset="0x1f0" rw="RW" size="4">
            <bitfield caption="PID Check Failure Interrupt Enable bit" mask="0x00000001" name="PIDEE" values="U1EIE__PIDEE" />
            <bitfield mask="0x00000002" name="CRC5EE_EOFEE" />
            <bitfield caption="CRC16 Failure Interrupt Enable bit" mask="0x00000004" name="CRC16EE" values="U1EIE__CRC16EE" />
            <bitfield caption="Data Field Size Error Interrupt Enable bit" mask="0x00000008" name="DFN8EE" values="U1EIE__DFN8EE" />
            <bitfield caption="Bus Turnaround Time-out Error Interrupt Enable bit" mask="0x00000010" name="BTOEE" values="U1EIE__BTOEE" />
            <bitfield caption="DMA Error Interrupt Enable bit" mask="0x00000020" name="DMAEE" values="U1EIE__DMAEE" />
            <bitfield caption="Bus Matrix Error Interrupt Enable bit" mask="0x00000040" name="BMXEE" values="U1EIE__BMXEE" />
            <bitfield caption="Bit Stuff Error Interrupt Enable bit" mask="0x00000080" name="BTSEE" values="U1EIE__BTSEE" />
         </register>
         <register caption="USB Status Register" name="U1STAT" offset="0x200" rw="R" size="4">
            <bitfield caption="Ping-Pong BD Pointer Indicator bit" mask="0x00000004" name="PPBI" values="U1STAT__PPBI" />
            <bitfield caption="Last BD Direction Indicator bit" mask="0x00000008" name="DIR" values="U1STAT__DIR" />
            <bitfield caption="Encoded Number of Last Endpoint Activity bits" mask="0x000000F0" name="ENDPT" values="U1STAT__ENDPT" />
         </register>
         <register caption="USB Control Register" name="U1CON" offset="0x210" rw="RW" size="4">
            <bitfield mask="0x00000001" name="USBEN_SOFEN" />
            <bitfield caption="Ping-Pong Buffers Reset bit" mask="0x00000002" name="PPBRST" values="U1CON__PPBRST" />
            <bitfield caption="RESUME Signaling Enable bit" mask="0x00000004" name="RESUME" values="U1CON__RESUME" />
            <bitfield caption="Host Mode Enable bit" mask="0x00000008" name="HOSTEN" values="U1CON__HOSTEN" />
            <bitfield caption="Module Reset bit" mask="0x00000010" name="USBRST" values="U1CON__USBRST" />
            <bitfield mask="0x00000020" name="PKTDIS_TOKBUSY" />
            <bitfield caption="Live Single-Ended Zero flag bit" mask="0x00000040" name="SE0" values="U1CON__SE0" />
            <bitfield caption="Live Differential Receiver JSTATE flag bit" mask="0x00000080" name="JSTATE" values="U1CON__JSTATE" />
         </register>
         <register caption="USB Address Register" name="U1ADDR" offset="0x220" rw="RW" size="4">
            <bitfield caption="7-bit USB Device Address bits" mask="0x0000007F" name="DEVADDR" values="U1ADDR__DEVADDR" />
            <bitfield caption="Low Speed Enable Indicator bit" mask="0x00000080" name="LSPDEN" values="U1ADDR__LSPDEN" />
         </register>
